[
  {
    "path": "posts/2024-10-06-duh-density-matters-for-transit/",
    "title": "Duh: Density Matters for Transit",
    "description": {},
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2024-11-16",
    "categories": [],
    "contents": "\nTransit Time\nI was recently in Europe (Paris - Salzburg - Munich - Porto - Lisbon). Of course the food, the drinks, the sights and the people (especially Portugese, which absolutely rank among the top 5 friendliest people I’ve ever met) were all amazing. But as a recovering Transportation Modeler for a mid-size Southern US city, I couldn’t help but be awed by the transit systems. The German system in particular was stereotypical efficient, but the Paris Metro was also a marvel. There’s been an immense quantity of literature and thinking on why the US transit system falls behind in comparison, both from a purposeful funding decisions and a ridership perspective. But this misses something that maybe you only experience when you travel that must be a prerequeiste to successful transit networks: density.\nIf you’ve read the Three Body Problem series (spoiler incoming) at one point, the entire earth population shifts to Australia. With billions of people located in the one continent, the population density of this new land resembled current day + alien free Japan. This fact was rather shocking, but perhaps this told me more about Japan than the alien takeover. Japan is ten times more dense than the US, 873 people per square mile, compared to the US’s 87. England is 8x more dense than the US.\nLet us look at a quick visual comaprison of the Eastern US seaboard, which is the most dense part of the US, and Western-Central Europe. For population density, I use this handy dandy webiste; and Open Railway Map for transit lines. Is this scientific? Is it even to scale to proplerly compare? Are we unneccessarily and naively applying AI or ML to this? No. No. No. That’s not the point. The point is to show that the US is not only not as dense, but critically, it does not have the necessary dense chain of potential stops. The Eno Center of Transportation post on this very subject in 2019 puts it succintly: “For fixed-guideway mass transportation (whether by railroad, or subway/elevated rail, or bus rapid transit), there’s just no substitute for population density as a measure of the need for, and likely success of, the system.” and that density matters for transit.\nThe US Case\nUS DensityUS TransitThe European Case\nEuropean DensityEuropean TransitConclusion\nI love dreaming of hypothetical transit networks across North America as much as the next ex-Transportation Modeler; but at some point the reality of the situation must be faced. The US is not dense enough to support the kind of transit networks that are seen in Europe. This is not to say that the US should not invest in transit, but that the US should be realistic about what kind of transit networks it can support without, ahem, changes in how cities are planned to encouerage sustainable densification.\n\n\n\n",
    "preview": {},
    "last_modified": "2024-11-16T13:33:34-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-10-20-good-eatins-toronto/",
    "title": "Good Eatin's: Toronto ",
    "description": {},
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2024-08-31",
    "categories": [],
    "contents": "\nToronto Food Recommendations\nUpdated August, 2024 to account for the mesmerizing Lake Inez. Enjoy!\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2024-08-31T16:53:24-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2024-05-02-biking-to-airports-is-nice/",
    "title": "Biking to Airports is nice ",
    "description": {},
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2024-05-28",
    "categories": [],
    "contents": "\nBiking to Airports, it’s great!\nFor those of you who aren’t aware, Toronto has two airports: Pearson, a huge, international hub that is 25 minute express train from downtown; and a smaller, more regionally focused ‘City of Toronto’ airport called Billy Bishop. Billy-B, as no one I’m aware calls it, is located right off the waterfront in the middle of the city; you could probably hit the CN Tower with a 7 iron. It must be the most urban-located airport in North America, unless I’m missing some evil villain’s secret jet strip in Queens.\n\nA major benefit of this type of locale for an airport is that it allows faithful customers to use multiple means of transit. I used to work in Transportation Planning in the Triangle area in North Carolina. The Raleigh-Durham (RDU) airport sits right in between, well, Raleigh and Durham (Chapel Hill you exist too, I didn’t forget). BUT, there is no easy transit (or bike lanes) from either city to the airport; even the bus lines are convoluted and push environmentally or budget minded customers to car-share or park-n-ride or whatever the hell a kiss-n-ride is. Not having transit lines extend to airport access for major cities is insane but also tremendously difficult to accomplish in the U.S. due to the way transit is funded and the lack of political will to make it happen at times, but also because of the way cities are designed.\nSo after we moved to Toronto, I had my eyes on the day I would finally fly out of Silly Billy Airport, as we live close enough that I could hop on a city bike, and cruise over! The ride over, in short, was glorious. The views from the Billy Bishop airport are also fantastic, the waiting area, for all three or so gates available, felt more like a nicer university than I went to library.\nThe trip over prompted some questions: is Billy Bishop the most accessible via bike compared to other major US and Canadian airports. My completely impartial and non-competitive hypothesis is that it offers access via bike to the greatest number of people, both in absolute and relative terms to the city’s population. To answer this, I started pulling isochrone (more on this below) and census data. For this analysis, I’m using mb_isochrone function from the mapboxapi package, very user friendly and effective. Their ‘profile’ methods of transportation include driving, walking, cycling, and driving in traffic. A transit map would require different packages, but would be a good follow up to this!\nThe Competitors\nFrom the American Delegation:\nJFK\nLAX\nO’Hare\nDC Reagan\nATL\nSFO\nDallas Fort Worth\nPHL\nSeattle\nDenver\nCharlotte\nOrlando\nFrom the Canadian Delegation:\nToronto Pearson\nSilly Billy\nMontreal\nVancouver\nIsochrone Madness\nTransportation Modeling 101: Isochrones: a travel distance map, taking into account existing networks. Usually measured in time, it uses aggregated and average travel distance (sometimes by time of day, AM vs PM) to plot out how far one could travel from a given point. These ink-blot looking items on the below map represent a 60 minute isochrone from each of the major airports we consider. You may have to zoom in to see these. For example, if you’ve been to the Denver airport, you may have asked yourself: “why did they build this airport in Kansas?” Then the shape of the isochrone may not be entirely surprising, given the airport’s location. Alternatively, DCA looks a bit more intuitive, given it is amazingly close to downtown DC.\nFor the analysis below, we’ll consider isochrones at 30, 45, and 60 minute intervals, meaning we’ll look at how far on average one could bike from the airport in 30, 45, or 60 minutes.\n\n\n\nWhat you’ll notice is that most airports are placed relatively far from the city they serve. This is sensible given the space these facilities require for safe operations and storage. The below graph shows the total area covered by each of the three isochrone sets. At first, it seems my hypothesis is ruined; not only is Silly Billy among the lowest in total area covered, but it’s not even better than Pearson (which doesn’t exactly make sense if you live here). Atlanta’s and DFA cover the most amount of area at the 60 minute mark, which may be true, but I’ve spent very little time at those airports and didn’t particularly notice a lot of bikers. The scaries are starting to set in for my hypothesis.\nHowever, it does track that Denver’s airport is the lowest, given it is located approximately 15 light years from downtown Denver and likely does not have bike lanes to/fro that many people would be able to take.\n\n\n\nShow me the People\nWho cares about area coverage? Well you should have, but not anymore! Let’s translate those isochrones into how many people are covered within those areas. We’ll use public US and Canadian census data to overlay loaded tracts with populations, then do a simple geospatial overlay to translate how many people are within the isochrone. This will show:\nHow many people are able to bike to airports in a given X minute interval\nGive a better comparison metric between airports that take into account the concentration and distribution of actual humans, instead of area.\nThe results are below: For the 60 minute definition, Silly Billy is not number 1… but it’s number 2! JFK leads the way, which fine, whatever, likely makes sense there are 4x as many people in NYC than Toronto. BUT! I will claim a modicum of vindication given over 500k people live within a 30 minute bike ride to Silly Billy, and over 1.5 million live within an hour bike ride.\nHowever, under the 45 and 30 minute definitions, the Billy Bishop airport is the most accessible by bike in to the greatest number of people of all the airports considered. This suggests that a significant number of people live within that 45 max biking isochrone of Billy Bishop, representing the dense Toronto downtown core, but when compared to JFK, the 60 minute isochrone is able to pull in more people given the sheer size of NYC. It seems like for those of us who are not donning their speedo like cycling jerseys and biking up to an hour with luggage but are rather willing to bike up to 30-45 miinutes to to get to the airport, Silly Billy is the best option.\n\n\n\nConclusion\nBiking to the airport is freeing, gets your body loose before you’re crammed into an aisle seat, is a carbon-free means of transit, is significantly cheaper than car-sharing or parking fees, and is overall awesome! If you ever get the chance to do it, do it!\n\n\n\n\n",
    "preview": "posts/2024-05-02-biking-to-airports-is-nice/biking-to-airports-is-nice_files/figure-html5/unnamed-chunk-6-1.png",
    "last_modified": "2024-05-28T09:53:44-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-03-good-eatins/",
    "title": "Good Eatin's: Durham",
    "description": "The hidden gems I didn't want to share",
    "author": [
      {
        "name": "Jacob Ford",
        "url": "https://jford-dchcmpo.github.io/Blog/posts/2021-12-30-Redistricting-and-Racial-Targetting/"
      }
    ],
    "date": "2023-11-14",
    "categories": [],
    "contents": "\nClick on a location, get my ‘don’t miss’ item(s) from each.\nMarch 2023 Update: We finally got to Zweli’s, America’s first Zimbabwean restaurant, owned and operated by the indomitable Williams duo. 10/10, we’ll certainly be back to try to oxtail which quickly sells out. Perhaps the happiest surprise: their lemonade was outstanding and almost worth a return journey alone!\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2023-11-14T17:16:22-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-08-12-crazy-nba-contracts-in-context/",
    "title": "Crazy NBA Contracts in Context",
    "description": "Super-Duper-Maxed",
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2023-09-26",
    "categories": [],
    "contents": "\nJaylen Brown, the monodextrous (just kidding) All NBA forward for the Boston Celtics, joins the vaunted halls of Mike Connely during waning days of the grit n grind Grizz mid-late 2010s era as the possessor of the single richest NBA contract in history. He won’t have this for long, as he soon be surpassed by other superstars including another Celtic player. Nonetheless, the numbers involved have been staggering to say the least. A five year, $303.7 million dollar extension. Thats an average of $60 million dollars per year.\nSalary Cap Increase\nFor the upcoming 2024 Fiscal Year NBA season, the salary cap is $136 million dollars. The new TV deals and whatever other shenanigans they’re doing (including a lot of amazing and not-so amazing work to globalize the NBA) results in the salary cap skyrocketing in the next ten years.\n\n\n\nBig Jumps\nThe below graph shows the annual percent change in the cap. Much has been written about the 2016 spike allowing some over powered dynasties to carry on their demonination a bit longer. But thats not even the highest spike in the last three decades; what the hell happaned in 1995-96? That’s for another day…\n\n\n\nThe Brown Case\nLets look at the top 21 salaries in the NBA over the next couple years. Obligatory laughing-out-loud moment for Ben Simmons being on this list.\n\n\n\n\n\n\nThe chart shows that Brown will be in the bottom of the top 25 paid players as a percentage of cap in the 2024 season. But after that, and critically before any mega-blooper deals are paid to Giannis, Luka, and Embiid, he’ll be in the top 5 or 3.\nShould Boston fans temporarily pause in their self flaggelation over their wittling salary cap? Maybe. Or maybe it helps to just remember that while they will be attributing ~40% of their cap to Jaylen Brown for the rest of the 2020s, whoever trades for Damian Lillard and the Phoneix Suns are doing the same with Bradley Beal. Given the age difference I’d much rather be Boston.\n\n\n\n",
    "preview": "posts/2023-08-12-crazy-nba-contracts-in-context/crazy-nba-contracts-in-context_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2023-09-26T15:38:04-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-08-26-lower-drinking-ages-higher-tax-revenues/",
    "title": "Lower Drinking Ages -> Higher Tax Revenues?",
    "description": "Unconsidered Sin Tax?",
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2023-09-26",
    "categories": [],
    "contents": "\nDraft\nPremise: I live in Canada now. The drinking age is 19, what is the estimated tax revenue omitted in the United States from a drinking age of 21?\nOne of my favorite courses in graduate school was an overview of American state legislatures taught by the fantastic Chris Ross, member of the Pennsylvania House of Representatives for six terms. At the end of the course, we simulated the creation of the Pennsylvania state budget for a given year, debating which programs would be funded or cut, how to make sensible negotiations with political opponents, and more concretely, just how many gold egotts would be dropped off at those troublesome mavericks.\nSin taxes were all the rage at the time. Specifically, increasing state taxes on liquor (if you’re not from Pennsylvania, you need to know just how strict liquor laws once were, so this idea had some traction), tobacco, or state lotteries. The idea of dropping the drinking age below 21 would have surely resulted in a public stoning, but what if it makes fiscal sense?\nThe Northern Example\n\n\n\n",
    "preview": {},
    "last_modified": "2023-09-26T15:51:19-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-08-09-2022-reading-list/",
    "title": "2022 Reading List",
    "description": {},
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2022-12-28",
    "categories": [],
    "contents": "\nLess delicious than the food recommendations, but more so for the\nsoul. My recent 2022 reading and listenings, yes I am a recent audiobook\nconvert. Two I would highly recommend from the below: the biography of\nJames A Baker III, which reads like a podcast version of the West Wing;\nand, sticking to the theme, Ron Silver aka Bruno Gianelli narration of\nPhillip Roth’s masterpiece, Plot Against America.\nOther highlights: fanboying over Olga Tokarczuk. Also, I have a\ntendancy of reading multiple works by same author, finally got to Echo\nMaker after loving the Overstory; did not disappoint but did not\nsurpass. And I’ve gone through five or so Phillip Roth pieces, starting\nwith the unforgettable Portnoy’s Complaint. But Plot Against America was\nstunning!\nOctober 2022 Update: I’m not sure where to put this, but my best\nfriend recommended a few mangas. I’ve put my nose up long enough - dove\ninto the Solo Leveling, absolutely gripping. Will continue and let you\nknow, some 200 chapters later :)\n\n\nTitle\n\n\nAuthor\n\n\nThe Echo Maker\n\n\nRichard Powers\n\n\nKlara and the Sun\n\n\nKazuo Ishiguro\n\n\nThe Man Who Ran Washington: The Life and Times of James A. Baker III\n\n\nPeter Baker & Susan Glasser\n\n\nChurwell & Orwell: The Fight for Freedom\n\n\nThomas E. Ricks\n\n\nFlights\n\n\nOlga Tokarczuk\n\n\nPlot Against America\n\n\nPhillip Roth\n\n\nBroken Earth Trilogy\n\n\nNK Jemisin\n\n\nDescrates Bones\n\n\nRussel Shorto\n\n\nThe City and the City\n\n\nChina Melville\n\n\nDutch House - Tom Hanks (!) narrated\n\n\nAnn Patchett\n\n\nSong of Achilles\n\n\nMadeline Miller\n\n\nBooks of Jacob\n\n\nOlga Tokarczuk (again)\n\n\nGiovannis Room\n\n\nJames Baldwin\n\n\nThe Witcher: The Last Wish\n\n\nAndrzej Sapkowski\n\n\nThe Power\n\n\nNaomi Alderman\n\n\nCivilizations: A Novel\n\n\nLaurent Binet\n\n\nFinding Me: A Memoir\n\n\nViola Davis\n\n\nBlack Cake\n\n\nCharmaine Wilkerson\n\n\nThree Body Problem\n\n\nLiu Cixin\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-12-28T18:48:28-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-09-30-south-korea-takeaways/",
    "title": "South Korea Takeaways",
    "description": "Busan -> Gyeongju -> Seoul.",
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2022-09-30",
    "categories": [],
    "contents": "\nTakeaways from this captivating country:\nFood tours: My wife organized a food tour through a few of\nSeoul’s many food markets for my birthday. A food tour remains the\nsingle most efficient use of condensed time to ‘see’ a city.\nBusan - something about the dichotomy between ocean and this\nmassive city skyline is surreal. I met my wife during the closing days\nof the 7th International Marine Debris Conference, so had a half day to\nmyself. The tried and true method of ordering food by pointing at\nanother person’s dish + thumbs up was further proved effective. Loved\nBusan, seemed to be a great jumping off point to other interesting areas\nalong the southern coast as well - Jeju being the most popular\nperhaps?\nSeoul’s National Museum of Korea is 1) housed in a massive and\ngorgeous building 2) would require better part of a full day to fully\nview, though can be sufficiently sifted through in a wondrous stupor\nwithin 4 hours and 3) is free! 10/10 recommend.\nGyeongju - from the population, it was much more domestic\ntravelers than international, which makes sense given the main\nattractions of Bulguksa and Seokguram Grotto, both classified as\nnational treasures. Walking through the parks in Gyeongju with the\nancient burrial mounds dotted throughout was amazing, very different\nthan the cityscapes of Seoul and Busan!\nThe distinct culture built over centuries of international\ninterference from Tang -> Mongols -> Chinese -> Japanese ->\nUnited States (apologies if that order leaves out any particular party)\nis absolutely unique to any country I’ve been to previously. For\nexample, at Bulguksa, the temple itself was destroyed by invading\nforces, and much of the scene today was rebuilt in modern times to\nancient specifications. At Seokguram Grotto, the 8th century masonry\nstill survives. At both locations, an equal level of intense pride was\nevident from Koreans. Their people are resilient and, rightfully, damn\nproud of the metropolitan wonder they have built while holding on to\ntheir history that goes back some five or six millennia.\nTransportation, ok lets talk about it. South Korea is roughly the\nsize of the state of Indiana, and it’s transportation system was nothing\nshort of stunning, efficient, fast and clean. Every metro stop had\nperfectly usable bathrooms - could you imagine this in the States! For\nall metros and buses, a single loadable card can be used across systems.\nThis part in particular blew my mind, what a convenient payment method\nfor users. I couldn’t imagine Los Angeles and San Francisco agreeing to\na unified name of a transportation system let alone a unified payment\nmethod.\nDrinking - every drink we had was based around a meal, which was\nsuch a slight but profound shift. Every night was a bit of a banger in\nour section of town, near Jonggak station in Seoul - which may be a\nfunction of the area - but sipping on soju or Korean beers over a spicy\nmeal is quite lovely :)\nStay young y’all :)\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-12-28T18:48:28-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-06-26-holc-redlining-and-our-old-census-friend/",
    "title": "HOLC, Redlining and Our old Census Friend",
    "description": "centroids, centroids, centroids",
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2022-06-26",
    "categories": [],
    "contents": "\nIntroduction\nCollapsed Zone Density\n\n\n\nHOLC Lines\nSource\n\n\n\nCombine Zoning & HOLC\n\n\n\nFurther analysis questions:\nusing centroid tagging, what is the proportion of Durham zones\nthat are represented by HOLC letters? i.e. are 80% low density homes in\nA grade zones?\nwhat about census population, census demograhpic + income\ncharacteristics?\nworking progress but very interesting.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-12-28T18:48:28-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-31-home-ownership-by-race/",
    "title": "Home Ownership by Race",
    "description": {},
    "author": [
      {
        "name": "Jacob Ford",
        "url": {}
      }
    ],
    "date": "2022-05-31",
    "categories": [],
    "contents": "\nIntroduction\nHow has home ownership rates (rent vs own) changed for different\nraces across the country? Which states experienced the largest changes\nfor different groups? We’ll look at total national home ownership rates\nat 2020 and 2015, then maybe look at a county level national map.\nData and Description\n\n\n\n\n\n\n\n\n\n\n\n\nFinal Graph\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-12-28T18:48:27-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-24-court-ordered-districts-more-fair/",
    "title": "Court Ordered Districts - More Fair?",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jacob Ford",
        "url": "https://jford-dchcmpo.github.io/Blog/posts/2021-12-30-Redistricting-and-Racial-Targetting/"
      }
    ],
    "date": "2022-02-24",
    "categories": [],
    "contents": "\nDeja-vu! The North Carolina Supreme Court rejected the maps that I\npreviously analyzed, instead opting to use maps drawn by outside\nexperts. Wowza! Let’s, hopefully one last time, see how these maps\ncompare to the 2010-2019 maps, the initially suggested redistricting by\nthe General Assembly, the February update post the initial legal\nchallenge, and now the court ordered drafted lines.\nNeed to re-run this with the get_ACS\nall blocks in 2020 census with:\nDemographic: white, black, asian, hispanic median income\nHouseholds\nVisualize new maps\nThe state house and state senate maps are final, only the\ncongressional maps are being altered. I didn’t know that until I added\nthe new maps (February in click option) to the below. If you don’t\nbelieve me, just find out for yourself.\nRecall, to train the models on the new congressional lines, I assumed\nthe 2022 midterms would follow FiveThirtyEight’s Partisan\nLean. This assumes the worst for Democrats in North Carolina, which\nI imagine is more likely than not.\n\n\n",
    "preview": "posts/2022-02-24-court-ordered-districts-more-fair/court-ordered-districts-more-fair_files/figure-html5/unnamed-chunk-9-1.png",
    "last_modified": "2022-12-28T18:48:27-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-12-08-Quantifying-NIMBYism/",
    "title": "Quantifying NIMBYism",
    "description": {},
    "author": [
      {
        "name": "Jacob Ford",
        "url": "https://jford-dchcmpo.github.io/Blog/"
      }
    ],
    "date": "2021-01-06",
    "categories": [],
    "contents": "\n\nVapid & Plastic\nTake a stroll down any street in my neighborhood in Durham, which many on this blog have called the Mecca of the South, and you’ll quickly notice the tell-tale sign that you’re in a quickly gentrifying, liberal leaning area: the lawn signs.\nBlack lives matter. Science is Real. Housing is a Human Right. Stop the Steal. (Just kidding about that last one)\nThese signs are sometimes critisized as virtue signaling But I’m not here to argue about lawn signs. I do believe that in the broad, middle to upper-middle class Democratic base there is a pervasive hypocrisy when it comes to political priorities espoused (often via lawn ornamentation) and the actions that defend and hoard opportunities for others. I was lucky to take a seminar from Richard Reeves of the Brooking Institute on the very subject, and he’s written prodigiously regarding this very confluence of virtue signaling and policy setting. These double-standards are nearly as ubiquitous as the aforementioned lawn signs: university legacy admissions, fiscal policy such as the mortgage interest deduction, 529 plans, estate and sales tax and most recently the absurd SALT deduction - which Reeves argues should be completely eliminated, and house zoning.\nI found myself wondering, are Durham zoning laws reflective of a majority Democratic enclave, a quickly growing liberal bubble? Are we, like many other cities in America, zoned predominately for single-family households? And above all, are Durham’s zoning ordinances aligned with beliefs of all those stupid lawn signs?\nNote: Durham’s Comprehensive Plan is being updated, so zoning ordinances are likely to occur.\nEDA\nI wish I could take a time machine back to a younger Jake, complaining about a problem set in his graduate quant class. Oh, is that perfectly cleaned data set provided by the professor annoying to load into your program? Is the codebook too succint? I wouldn’t hit this Jake, violence is never the answer, but I would shake him a bit.\nThe question we’re trying to answer is to what degree is Durham’s zoning amenable to non-single family homes? Using 2020 census data, we can determine the percentage of Durham-ites zoned for single or multiple family homes. Growth in households and population will be measured based on where that growth is occuring by zone type. First, we need the zone type.\nZone Types\nDurham’s zoning data is publicly available, and is classified in an understandably long-winded manner. Below are the initial zone types:\n\n\n                     COMMECIAL                     COMMERCIAL \n                             1                            520 \n            COMMERCIAL GENERAL              COMMERCIAL INFILL \n                             3                              2 \n             COMMERCIAL_INFILL        COMMERCIAL_NEIGHBORHOOD \n                             1                              1 \n           COMPACT DESIGN-CORE COMPACT DESIGN-PEDESTRIAN BUS. \n                             2                              1 \n      COMPACT DESIGN-SUPPORT 1       COMPACT DESIGN-SUPPORT 2 \n                             1                              2 \n       COMPACT SUBURBAN DESIGN           DOWNTOWN DESIGN-CORE \n                             4                              2 \n     DOWNTOWN DESIGN-SUPPORT 1      DOWNTOWN DESIGN-SUPPORT 2 \n                             5                              8 \n                    INDUSTIRAL                     INDUSTRIAL \n                             2                            174 \n                     MIXED USE                      MIXED_USE \n                             1                             15 \n          OFFICE_INSTITUTIONAL               RES_HIGH_DENSITY \n                           247                            419 \n               RES_LOW_DENSITY             RES_MEDIUM_DENSITY \n                           447                            166 \n             RES_RURAL_DENSITY                       RESEARCH \n                           177                             13 \n             RURAL RESIDENTIAL           UNIVERSITY COLLEGE-2 \n                             1                              2 \n\nAs the songbird of our generation Carly Rae Jepson once said, let’s cut to the feeling.\nLet’s collapse each zone into broad buckets: residential, commercial, university, downtown and compact. The last two will be treated nearly identically. Compact is a newer designed zone theorized to increase density, multimodal traffic like transit and bike lanes, and allow access to work and play in and around Durham.\nThe below table from the previous Durham Comprehensive Plan shows the below table, which we will use to approximate dwell units permitted on each type of zone. Downtown zones in the ‘High’ Density have a hilarious “unlimited” density limit, so I’m expecting a new Burj Khalifa sooner rather than later with that type of free reign. Note, I will use the median value of the density ranges, but it doesn’t matter too much, as you’ll see.\n\nAfter collapsing, we get the following reduced zones below.\n\n\n Commerical     Compact    Downtown Residential  University \n        969          10          15        1223          11 \n\nThe interactive map shows these collapsed categories for the whole county. Most of the county is zoned residential, which makes sense. Commercial zones mainly follow along the major highway corridor NC 147 and I-40, along with smatterings here and there. The compact zones are relatively concentrated just north of Duke’s main campus. There are a number of condos and apartment buildings, a few hotels even, in that zone.\n\n\n\nCollapsed Zone Density\n\n\n\nMax Dwell Units by Zone\nFollowing the table shown above, the max dwell units by zone type are shown. University zones are removed for simplicity.\n\n\n\nThe units/acre map doesn’t show too much information, outside of East Durham is likely due for some expanded zoning restrictions. What I find interesting is the collapsed zone density map, the little pockets of high density in Trinity Park, where I walk my dog several times a day and fight the urge to not just allow but actively encourage Charlie the Greyhound to pee on the quarter million dollar McMansion sprouting up between the duplexes and triplexes which are clearly fit in those little pockets of high density zoned plots.\nI’m also kidding, Charlie is far too polite of a pup, and I am not one of those monster dog owners.\nWhat may help illuminate this is to see how many people are living in these type of zones.\nHeaping Cup of Demographic Data\nThe question we want to answer: how many people and households reside in the variety of zones, and how has that changed? Are zones meeting the explosion of demand in Durham?\nUsing the 2020 and 2010 census data, with some geospatial data science stacks, we can tag each residential zone type with the sum of households and total population represented.\nThe first two graphs show these results. The majority of the population in Durham County lives in low density zones, nearly a third of the total population. Downtown and Compact combined represented 11,000 population in 2020, which more than doubled compared to 2010. Households follow a similar trend.\n\n\n\n\nThe second set of graphs show the percent increase from 2010 to 2020 for each zone. Compact and Downtown saw a dramatically higher increase. These are encouraging results for these newer designed zones. But these graphs also show how supply is matched with demand in a manner. The Downtown zones saw a dramatic increase, almost twice the growth in supply compared to demand. This doesn’t immediately suggest that there is a glut of downtown households available, as the supply very well may have been rushing to meet existing, previous demand.\n\n\n\nNIMBY Score\nWorking on this section…..\nLet’s develop a super simple quantitative measure for NIMBY-ism.\nLet’s tag each zone in Durham with the population and households within the respective zone. We will then be able to see how housing supply changed from 2010 to 2020.\n\n\n\nMap new NIMBY score, which is just standardized HH_Growth from 0 - 1\nto do -\npick up where i left on 1.18.22 - the map is close, but may be useful to collapse the difference b/w the HHs and the HH’s zoned by category\nReferences\nhttps://medium.com/@NYUurbanlab/actually-nimbys-cities-arent-building-enough-51806be038ae\nhttps://abundanthousingla.org/meet-l-a-countys-biggest-nimbys/\nhttps://live-durhamnc.opendata.arcgis.com/datasets/zoning/explore?location=36.012451%2C-78.920767%2C15.62\nhttps://maps.durhamnc.gov/?x=36.01483037908998&y=-78.92072715568013&z=18055.9548215&r=0&b=11&pid=NA&s=zoning&l=active_address_points,countymask,transitionalofficeoverlay,NPO,NHD,LocHistLandmarks,airportoverlay,citylimits,RTPboundary,parcels,zoning,\n\n\n\n",
    "preview": {},
    "last_modified": "2022-12-28T18:48:27-05:00",
    "input_file": {}
  }
]
